{"pageProps":{"title":"Revolutionizing Disease Data Access: Airfinity's Journey to Lightning-Fast Insights","logoLink":"/assets/img/customer-story/airfinity_white.svg","source":{"compiledSource":"var h=Object.defineProperty,c=Object.defineProperties;var m=Object.getOwnPropertyDescriptors;var s=Object.getOwnPropertySymbols;var n=Object.prototype.hasOwnProperty,r=Object.prototype.propertyIsEnumerable;var l=(e,a,t)=>a in e?h(e,a,{enumerable:!0,configurable:!0,writable:!0,value:t}):e[a]=t,o=(e,a)=>{for(var t in a||(a={}))n.call(a,t)&&l(e,t,a[t]);if(s)for(var t of s(a))r.call(a,t)&&l(e,t,a[t]);return e},d=(e,a)=>c(e,m(a));var p=(e,a)=>{var t={};for(var i in e)n.call(e,i)&&a.indexOf(i)<0&&(t[i]=e[i]);if(e!=null&&s)for(var i of s(e))a.indexOf(i)<0&&r.call(e,i)&&(t[i]=e[i]);return t};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(t){var i=t,{components:e}=i,a=p(i,[\"components\"]);return mdx(MDXLayout,d(o(o({},layoutProps),a),{components:e,mdxType:\"MDXLayout\"}),mdx(\"p\",null,\"During the global COVID-19 pandemic, I worked for Airfinity, a disease forecasting company that rapidly adapted to the fast-moving nature of the outbreak. As we collected and aggregated various data, it became clear that we needed to move quickly. Our small development team innovated to meet these challenges. Although the platform initially struggled, with some pages taking an unacceptable 28 seconds to load, we were able to solve these issues effectively.\"),mdx(\"img\",{src:\"/assets/img/customer-story/airfinityss.jpg\",alt:\"Airfinity Website\",style:{maxWidth:700,width:\"100%\"}}),mdx(\"h2\",null,\"In Search of the Best Way to Deliver Data\"),mdx(\"p\",null,\"During this time, requirements changed within days, and the shape of data varied significantly. At its simplest, we provided tables with powerful search and filtering systems. We also delivered many custom dashboards, graphs, and analyses daily, often tailored to specific entities' needs.\"),mdx(\"p\",null,\"To meet these demands, we built a custom platform and utilized other tools like Tableau and Shiny dashboards, depending on the best fit for the required data.\"),mdx(\"h3\",null,\"Configuration over Code\"),mdx(\"p\",null,'One key challenge was serving this ever-changing data in a timely manner. We addressed this through our \"configuration over code\" approach.'),mdx(\"p\",null,\"While this term isn't widely explained online, it essentially means preferring to use a set of settings instead of code to modify a program. For example:\"),mdx(\"p\",null,\"Preferring:\"),mdx(\"pre\",null,mdx(\"code\",o({parentName:\"pre\"},{className:\"language-tsx\"}),`const paragraphs = [\n  \"Hello\",\n  \"World\"\n]\n\n<>\n    {paragraphs.map(paragraph => <p>{paragraph}</p>)}\n</>\n`)),mdx(\"p\",null,\"Instead of:\"),mdx(\"pre\",null,mdx(\"code\",o({parentName:\"pre\"},{className:\"language-tsx\"}),`<>\n    <p>Hello</p>\n    <p>World</p>\n</>\n`)),mdx(\"p\",null,\"This simple example illustrates a concept we applied throughout the platform.\"),mdx(\"h3\",null,\"Using Typescript as our configuration object\"),mdx(\"p\",null,\"A crucial decision was choosing the form of our configuration object. We opted for TypeScript for its type validation, allowing us to move quickly without unknowingly breaking things. We validated routes, data columns, and even smaller elements with features like string unions.\"),mdx(\"p\",null,\"This approach made it easy to add content while maintaining strong type checks. Importantly, we could compose our configuration in various ways, abstracting and reusing similar configs across pages. However, we approached this carefully, as shared elements don't always warrant combination.\"),mdx(\"p\",null,\"While this method proved great overall, it did have some limitations:\"),mdx(\"h4\",null,\"1. Using complex types makes it harder to onboard developers\"),mdx(\"p\",null,\"In some parts of the system, we implemented strict checks to avoid common errors. This involved a pretty complex set of types. This worked well but required developers to understand the types to make changes, presenting a challenge for those without TypeScript knowledge. Despite this, we felt it was a fair trade-off.\"),mdx(\"h4\",null,\"2. Dead Configuration\"),mdx(\"p\",null,\"The ease of adding new configurations led to daily additions. However, this also made it easy to leave unused elements in the system. Periodically, we had to clean up these unused configurations to maintain easier system maintenance.\"),mdx(\"h4\",null,\"3. Serializability\"),mdx(\"p\",null,\"Using TypeScript allowed us to include non-serializable elements like functions and classes in the config. While convenient, this came at the cost of serializability and the ability to perform static analysis.\"),mdx(\"h2\",null,\"Managing Data Overload. From 28s -> 1.8s Load Time\"),mdx(\"p\",null,\"Our rapid development occasionally required implementing quick solutions. One such instance occurred when users reported extremely long load times on certain data-heavy pages. The ideal solution of fetching only necessary data from the backend wasn't immediately feasible due to complex data manipulations and user customizations. So we made the call to handle this on the frontend.\"),mdx(\"p\",null,\"We implemented an incremental loading and caching system using web workers and IndexedDB for storage. This system loaded data incrementally using exponential backoff through a web worker to avoid blocking the UI thread. The data was then cached in IndexedDB, allowing us to perform needed manipulations without significant performance penalties and allowing us to reuse data on subsequent visits. This approach also required us to manage cache invalidation, but that's a story for another time.\"),mdx(\"p\",null,\"Implementation was challenging, with many moving parts and obstacles like the serializability issue mentioned earlier. The diagram below illustrates the approximate structure of this solution.\"),mdx(\"img\",{src:\"/assets/img/customer-story/airfinity-diagram.png\",alt:\"Airfinity Diagram\",style:{maxWidth:700,width:\"100%\"}}),mdx(\"h2\",null,\"The Impact\"),mdx(\"p\",null,\"After implementing these solutions, we achieved:\"),mdx(\"ol\",null,mdx(\"li\",{parentName:\"ol\"},\"A 93.5% improvement in page load times, reducing them from 28 seconds to just 1.8 seconds in the worst cases\"),mdx(\"li\",{parentName:\"ol\"},\"Maintain real-time data access crucial for timely decision-making\"),mdx(\"li\",{parentName:\"ol\"},\"Scale the platform to handle the ever-growing influx of data\"),mdx(\"li\",{parentName:\"ol\"},\"Kept the platform simple and easy to work with for future developers\")),mdx(\"p\",null,\"Airfinity has since then won the \",mdx(\"a\",o({parentName:\"p\"},{href:\"https://www.ft.com/content/dfff94c2-599f-4f3a-a012-96738279364e\"}),\"Tech Champions 2023 award\"),\" and was shortlisted for the \",mdx(\"a\",o({parentName:\"p\"},{href:\"https://www.airfinity.com/articles/airfinity-shortlisted-for-dataiq-awards-2023-best-data-story-or-data\"}),\"DataIQ Awards 2023 \\u2018Best Data Story or Data Visualisation\\u2019 award\"),\". They have also expanded their operations to the US and Japan.\"))}MDXContent.isMDXComponent=!0;\n","scope":{}}},"__N_SSG":true}