{"pageProps":{"title":"Making YouTube video with React","description":"I wanted a good animation for my first YouTube video. But with no experience with tools like After Effects, what can I do? React JS to the rescue!","image":"/assets/blog/making-youtube-video-with-react/making-youtube-video-with-react.png","createdAt":"Thu Feb 23 2023 00:00:00 GMT+0000 (Greenwich Mean Time)","source":{"compiledSource":"var d=Object.defineProperty,m=Object.defineProperties;var c=Object.getOwnPropertyDescriptors;var i=Object.getOwnPropertySymbols;var r=Object.prototype.hasOwnProperty,s=Object.prototype.propertyIsEnumerable;var h=(t,a,o)=>a in t?d(t,a,{enumerable:!0,configurable:!0,writable:!0,value:o}):t[a]=o,e=(t,a)=>{for(var o in a||(a={}))r.call(a,o)&&h(t,o,a[o]);if(i)for(var o of i(a))s.call(a,o)&&h(t,o,a[o]);return t},p=(t,a)=>m(t,c(a));var l=(t,a)=>{var o={};for(var n in t)r.call(t,n)&&a.indexOf(n)<0&&(o[n]=t[n]);if(t!=null&&i)for(var n of i(t))a.indexOf(n)<0&&s.call(t,n)&&(o[n]=t[n]);return o};const makeShortcode=t=>function(o){return console.warn(\"Component \"+t+\" was not imported, exported, or provided by MDXProvider as global scope\"),mdx(\"div\",e({},o))},Video=makeShortcode(\"Video\"),layoutProps={},MDXLayout=\"wrapper\";function MDXContent(o){var n=o,{components:t}=n,a=l(n,[\"components\"]);return mdx(MDXLayout,p(e(e({},layoutProps),a),{components:t,mdxType:\"MDXLayout\"}),mdx(\"p\",null,\"I recently started a YouTube channel. It's the educational kind where I explain cool technologies. My inspiration was channels like \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.youtube.com/@Wendoverproductions\"}),\"Wendover Productions\"),\" and \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.youtube.com/@KentoBento\"}),\"Kento Bento\"),\". One thing I want to get right is animations. I have previously watched a lot of videos by \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.youtube.com/@3blue1brown\"}),\"3Blue1Brown\"),\". Their animation is very useful for explaining complex topics.\"),mdx(\"p\",null,\"The problem is that I\\u2019ve never used tools like After Effects before. I also don\\u2019t want to learn or pay for it. Actually, I can\\u2019t even use it since I\\u2019m running Linux.\"),mdx(\"p\",null,\"Being a \\u201Cgood\\u201D programmer, I thought \\u2014 why not make the animation in React? What could go wrong?\"),mdx(\"h2\",null,\"React is my home turf\"),mdx(\"p\",null,\"Now, I wanted something programmable. Somewhere you can tweak text and numbers instead of manually aligning elements. I don\\u2019t want to copy-paste hundreds of times when it could be a simple loop. And the idea of reusing past components is appealing to me.\"),mdx(\"p\",null,\"Why React though? Well, it\\u2019s what I\\u2019m most familiar with. All my projects are built using it and I can create layouts with CSS pretty quickly. In fact, I\\u2019ve created \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://github.com/Vija02/LD39\"}),\"a game with React + CSS Grid\"),\" for a game jam in the past.\"),mdx(\"p\",null,\"And most importantly, it\\u2019s fun!\"),mdx(\"h2\",null,\"The alternative was painful\"),mdx(\"p\",null,\"For comparison's sake, I animated a simple scene in \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.blackmagicdesign.com/products/davinciresolve/\"}),\"Davinci Resolve\"),\" using a few tutorials from YouTube. This is the result:\"),mdx(Video,{src:\"/assets/blog/making-youtube-video-with-react/davinci-anim.mp4\",mdxType:\"Video\"}),mdx(\"p\",null,\"That\\u2019s it. But for such a simple scene, it was a major pain to create. Here\\u2019s what the node graph looks like. Even worse, if I want to change a group of items slightly, I have to update them separately.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/assets/blog/making-youtube-video-with-react/davinci-node-graph.png\",alt:\"Davinci Resolve Node Graph\"}))),mdx(\"h2\",null,\"First scene concept\"),mdx(\"p\",null,\"I had an image of what I wanted to illustrate. \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.youtube.com/watch?v=kOjgPTj9MKM\"}),\"The video\"),\" is about how the PS3 was used as a supercomputer. For that, a bunch of them were clustered into a single machine. I wanted to show how many PS3s were used. Showing a number is fine but I also wanted to show each physical machine.\"),mdx(\"p\",null,\"First, a single PS3 would appear, then a few dozen, then hundreds and then to its final amount. All while animating the previous ones to their new position. Here\\u2019s the result:\"),mdx(Video,{src:\"/assets/blog/making-youtube-video-with-react/ps3-result.mp4\",mdxType:\"Video\"}),mdx(\"h2\",null,\"The project setup\"),mdx(\"p\",null,\"To bootstrap the project, I used Next.js. This part doesn\\u2019t matter much. But its file-based routing is convenient for separating different scenes. I can just create a new file for each scene.\"),mdx(\"h3\",null,\"Animating Library\"),mdx(\"p\",null,\"While researching for this, I had an idea of scenes I want to make. For example: Graphs, Pie charts and \",mdx(\"strong\",{parentName:\"p\"},\"illustrating how a CPU work\"),\" with simple boxes. One of the ideas of using React is to leverage its large amount of open-source libraries.\"),mdx(\"p\",null,\"However, It turns out that most packages don\\u2019t handle animation very well. And if it has any, it\\u2019s likely not configurable. So I began looking for an animation library and came across Anime.js.\"),mdx(\"p\",null,mdx(\"a\",e({parentName:\"p\"},{href:\"https://animejs.com/\"}),\"Anime.js\"),\" is great because I can simply define the initial state and the goal. Anime.js will handle everything in between.\"),mdx(\"p\",null,\"Here\\u2019s a snippet of the final code:\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/assets/blog/making-youtube-video-with-react/ps3-code.jpg\",alt:\"PS3 Animation Code\"}))),mdx(\"p\",null,\"There are some maths involved to calculate where each PS3 image should go. However, the animation calculation is all done by Anime.js. Not bad.\"),mdx(\"h3\",null,\"Recording & Exporting\"),mdx(\"p\",null,\"Now the harder part is finding a way to record and export the animation. I wanted to automate this process. Recording my screen sounded like a very crude way of doing this. Ideally, it should take its time to render each frame as it needs and create an mp4 file. This is so that:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Even if the animation doesn\\u2019t run smoothly on my machine, it still will show up smooth on the recording\"),mdx(\"li\",{parentName:\"ul\"},\"The resolution will be correct. My screen is HD so I can capture that but what if I want a larger resolution? Recording this way would also take a whole monitor which is annoying.\")),mdx(\"h2\",null,\"Problems and Iterations\"),mdx(\"p\",null,mdx(\"strong\",{parentName:\"p\"},\"rrweb + rrvideo\")),mdx(\"p\",null,\"In the end, I had to experiment quite a few times. First, I tried using \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://github.com/rrweb-io/rrweb\"}),\"rrweb\"),\" since it was something that was already on my radar. The idea is I would record using that and convert it into a video using \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://github.com/rrweb-io/rrvideo\"}),\"rrvideo\"),\".\"),mdx(\"p\",null,\"This approach was\\u2026 alright. It\\u2019s an alternative to recording my screen. The advantage is that rrvideo spawns a separate chrome instance (through puppeteer). This allows the recording to run headlessly.\"),mdx(\"p\",null,\"The disadvantage is it brings a bunch of complexity to an otherwise simple task. The initial recording step is also an unnecessary process.\"),mdx(\"p\",null,mdx(\"strong\",{parentName:\"p\"},\"Canvas w/ paper.js\")),mdx(\"p\",null,\"The previous Anime.js with HTML+CSS approach worked with a few elements. But it didn\\u2019t run very well once I added hundreds of images. Each PS3 was an image and rendering a thousand of them was not great for performance. I wasn\\u2019t able to get it running at 30 fps for the whole sequence.\"),mdx(\"p\",null,\"To solve that issue, I searched for some solutions using canvas. I didn\\u2019t want to work with pure canvas so after doing some research, I settled with \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://github.com/paperjs/paper.js\"}),\"paper.js\"),\".\"),mdx(\"p\",null,\"Using paper.js was convenient because it allows me to reuse the Anime.js logic I have previously written. Instead of modifying the DOM element directly, I modified it to update a JSON object. Then I use that object to update the canvas every tick.\"),mdx(\"p\",null,\"It\\u2019s not very elegant but it worked so good enough!\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/assets/blog/making-youtube-video-with-react/canvas-draw.jpg\",alt:\"Canvas Draw Code\"}))),mdx(\"p\",null,mdx(\"strong\",{parentName:\"p\"},\"Canvas Capturing\")),mdx(\"p\",null,\"I also tried to find a better recording method. Since I\\u2019m now using canvas, there are some solutions to recording that seemed quite elegant. For example, paper.js uses \",mdx(\"inlineCode\",{parentName:\"p\"},\"requestAnimationFrame\"),\" to achieve its smooth animation. There are libraries like \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://github.com/spite/ccapture.js/\"}),\"ccapture.js\"),\" that hooks into the various methods like \",mdx(\"inlineCode\",{parentName:\"p\"},\"requestAnimationFrame\"),\" and \",mdx(\"inlineCode\",{parentName:\"p\"},\"setInterval\"),\", allowing it to render each frame separately.\"),mdx(\"p\",null,\"Using this approach works but it was quite troublesome to get working. For example, the animation loop needs to be started before the recording starts. This is quite annoying to deal with. It also means that it\\u2019s not possible to add a delay between animation easily.\"),mdx(\"p\",null,mdx(\"strong\",{parentName:\"p\"},\"Recording manually was a good enough solution\")),mdx(\"p\",null,\"With that problem in the way, I decided to record the screen manually instead. For this, running a simple \",mdx(\"inlineCode\",{parentName:\"p\"},\"ffmpeg\"),\" command was good enough to get the results I wanted. You can see the results in the 2nd video above.\"),mdx(\"h2\",null,\"Utilizing other React libraries\"),mdx(\"p\",null,\"The next scene I had in mind was an animated pie chart. There are so many charting libraries around that I was sure one of them would fit my needs. The pie chart below was rendered using \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://github.com/recharts/recharts\"}),\"recharts\"),\", utilizing its mount animation. To get the results, I recorded my screen like the first scene.\"),mdx(Video,{src:\"/assets/blog/making-youtube-video-with-react/pie-result.mp4\",mdxType:\"Video\"}),mdx(\"h2\",null,\"The actually useful animation!\"),mdx(\"p\",null,\"And finally, the reason I wanted my videos to be animated in the first place. Below is a simple illustration of the difference between how the CPU processes data compared to the GPU. It helps to illustrate the point instead of simply saying it in words.\"),mdx(Video,{src:\"/assets/blog/making-youtube-video-with-react/cpugpu-result.mp4\",mdxType:\"Video\"}),mdx(\"p\",null,\"For this scene, I decided to research other ways to achieve this. The Anime.js method was decent but it was rather clunky particularly in terms of timing it. Meanwhile, the canvas method was performant but I\\u2019d rather use a \\u201Cproper\\u201D tool if I can\\u2019t leverage React\\u2019s tooling or even CSS.\"),mdx(\"h2\",null,\"Target based animation\"),mdx(\"p\",null,\"A bit more research led me to \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.framer.com/motion/\"}),\"Framer Motion\"),\". I\\u2019ve actually heard about the library in the past. I hadn\\u2019t used it since I never needed it. But I did experience it through other libraries like the excellent \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://chakra-ui.com/\"}),\"Chakra UI\"),\" library.\"),mdx(\"p\",null,\"Like Anime.js, Framer motion lets you define the result you wanted. The library will then handle the animation part. However, Framer motion has the added benefit of having a nicer workflow. It\\u2019s all directly in React. In my React code, I can simply define what to render depending on a state. Then, I can play around with the state to change between scenes. Framer motion will handle the rest.\"),mdx(\"p\",null,\"After hooking the state value to key press events, I can control when I want to transition with a button press. This also allows me to match the animation with my video.\"),mdx(\"p\",null,\"Below is how the white blocks in my video that flow between the RAM and GPU is defined. Isn\\u2019t it nice? To start the animation I only need to render it. In this case, incrementing the \",mdx(\"inlineCode\",{parentName:\"p\"},\"variant\"),\" counter.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/assets/blog/making-youtube-video-with-react/framer-motion-code.jpg\",alt:\"Framer Motion Code\"}))),mdx(\"h3\",null,\"CSS layout animation\"),mdx(\"p\",null,\"Another added benefit of Framer Motion is its layout animation capabilities. With Anime.js, I\\u2019m limited to animating linear values. But what if I added a new element or changed a flexbox property? It wouldn\\u2019t work at all. Thankfully, Framer Motion handles this use case nicely.\"),mdx(\"h3\",null,\"Transparency is a chore to deal with\"),mdx(\"p\",null,\"So that was the stack that I used for the rest of the animation. There are other details and methods that I had to deal with in the making of this video. Many of them are omitted since they never went anywhere.\"),mdx(\"p\",null,\"But one detail I had to work around is transparency. To get it working, I set the animation to have a green background. In Davinci Resolve, I can then mask/key the background away. This worked but it limited the colors I could use in my animation.\"),mdx(\"h2\",null,\"Should you do it?\"),mdx(\"p\",null,\"Probably not. I\\u2019m sure there are good ways of doing this without code. Though I can\\u2019t recommend any since I\\u2019ve never tried them. But if you are someone who managed to read this far, then you're probably savvy enough to do something like this!\"),mdx(\"h2\",null,\"Future solution\"),mdx(\"p\",null,\"Now that I\\u2019m planning for a second video, there are other stuff that I\\u2019d like to try. For example: \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://motioncanvas.io/\"}),\"Motion Canvas\"),\". This tool is authored by someone who was looking for something similar to me. He actually has a whole video explaining the tool. It included various features like timing the animation with audio and rendering it per frame. It also renders the animation as an image sequence. I\\u2019m assuming this would solve the transparency problem nicely.\"),mdx(\"p\",null,\"If you know other tools that solve this in a good way, do let me know!\"),mdx(\"hr\",null),mdx(\"p\",null,\"That's it for now. If you\\u2019re interested in the final video, you can watch it here: \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.youtube.com/watch?v=kOjgPTj9MKM&t=62s\"}),\"https://www.youtube.com/watch?v=kOjgPTj9MKM\"),\". If you like this article, you might like the contents of the video too.\"))}MDXContent.isMDXComponent=!0;\n","scope":{}}},"__N_SSG":true}