{"pageProps":{"title":"I have a new Junior Developer and it kinda sucks","description":"ChatGPT is all the rage these days. Is it really that good for developers though?","image":"/assets/blog/i-have-a-new-junior-developer/i-have-a-new-junior-developer.png","createdAt":"Thu May 11 2023 01:00:00 GMT+0100 (British Summer Time)","source":{"compiledSource":"\"use strict\";\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = {\n    a: \"a\",\n    br: \"br\",\n    code: \"code\",\n    h2: \"h2\",\n    img: \"img\",\n    li: \"li\",\n    p: \"p\",\n    strong: \"strong\",\n    ul: \"ul\",\n    ..._provideComponents(),\n    ...props.components\n  };\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"That developer is ChatGPT and I have a love-hate relationship with it.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"There are so many articles about AI nowadays so I’ll try to keep this one short.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"TL;DR:\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Using ChatGPT to code is like having a Junior developer under you. They can get the code 80% there but you’ll need to review practically every line.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"The scenario\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I have to admit that there are plenty of ways you could use ChatGPT to help write code. It’s probably better at some of them and worse at others.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"For example, I’ve heard plenty of people using it as a search engine. I personally find that a bit questionable. It’s not that hard to find documentation or even answers through search. I use \", _jsx(_components.a, {\n        href: \"https://kagi.com/\",\n        children: \"Kagi\"\n      }), \" which helps to cut down the fluff. On the contrary, using ChatGPT, how are you supposed to know if the answer is true?\"]\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"On the other side of the spectrum, there are plenty of people using it as a glorified auto-completion. Something like \", _jsx(_components.a, {\n        href: \"https://github.com/features/copilot\",\n        children: \"Github Copilot\"\n      }), \". I can see that being useful.\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The scenario I’ve chosen is:\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsxs(_components.strong, {\n        children: [\"Converting my code from \", _jsx(_components.a, {\n          href: \"https://chakra-ui.com/\",\n          children: \"chakra-ui\"\n        }), \" to \", _jsx(_components.a, {\n          href: \"https://tailwindcss.com/\",\n          children: \"tailwindcss\"\n        }), \".\"]\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Why?\"\n    }), \"\\n\", _jsxs(_components.ul, {\n      children: [\"\\n\", _jsx(_components.li, {\n        children: \"There are plenty of resources for both technologies, especially Tailwind (and of course, HTML). It should have plenty of data to work from.\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"It is very possible to create a program to do this. While there may be plenty of edge cases, the functionality itself is straightforward. chakra-ui is inspired by tailwind so it inherits a bunch of things that can be easily transferred.\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"It is something I need to do. So it’s a real use case that someone else might encounter.\"\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Prompt engineering is a chore\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Looking around the field, it seemed like prompting well is the difference between getting good or mediocre results. I’m not the best at this but I did some research and tried my best.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I made sure to use multiple prompts to get it to a good state. Only pasting my code whenever it seems like it knows it should only convert my code.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Honestly, this part could be improved. Between the UI and the interaction, it’s quite a chore to use:\"\n    }), \"\\n\", _jsxs(_components.ul, {\n      children: [\"\\n\", _jsxs(_components.li, {\n        children: [\"\\n\", _jsxs(_components.p, {\n          children: [_jsx(_components.strong, {\n            children: \"It can take some time for it to reach the desired state\"\n          }), _jsx(_components.br, {}), \"\\n\", \"Between me thinking what to write, then waiting for it to respond and finish writing, it gets quite annoying to do this work\"]\n        }), \"\\n\"]\n      }), \"\\n\", _jsxs(_components.li, {\n        children: [\"\\n\", _jsxs(_components.p, {\n          children: [_jsx(_components.strong, {\n            children: \"It’s inconsistent\"\n          }), _jsx(_components.br, {}), \"\\n\", \"It doesn’t help that you can’t always reuse the same prompts. ChatGPT has some randomness to it so I had to tweak the prompt every single time. Copy-pasting a prompt that worked previously didn’t help.\"]\n        }), \"\\n\"]\n      }), \"\\n\", _jsxs(_components.li, {\n        children: [\"\\n\", _jsxs(_components.p, {\n          children: [_jsx(_components.strong, {\n            children: \"It’s very easy to get out of the desired state\"\n          }), _jsx(_components.br, {}), \"\\n\", \"The above is fine if it’s a one-time thing. But I found that it’s very easy for the AI to forget everything after the first code conversion. The most repeated success I had was 3 times I believe. Beyond that, it returned completely unrelated things like explaining what my code does.\"]\n        }), \"\\n\"]\n      }), \"\\n\", _jsxs(_components.li, {\n        children: [\"\\n\", _jsxs(_components.p, {\n          children: [_jsx(_components.strong, {\n            children: \"Token is quite a limiting factor\"\n          }), _jsx(_components.br, {}), \"\\n\", \"There’s only so much code that it can produce due to its token limit. You can check the \", _jsx(_components.a, {\n            href: \"https://platform.openai.com/tokenizer\",\n            children: \"tokenizer here to see how it calculates the tokens\"\n          }), \". It’s not very friendly for code. Below is an example of one of its outputs. Each different color represents a token.\"]\n        }), \"\\n\", _jsx(_components.p, {\n          children: _jsx(_components.img, {\n            src: \"/assets/blog/i-have-a-new-junior-developer/tokenizer.jpg\",\n            alt: \"Tokenizer\"\n          })\n        }), \"\\n\", _jsx(_components.p, {\n          children: \"Because of this, I have to split the conversion into multiple steps. Otherwise, the generation will stop in the middle. Telling it to continue doesn’t work most of the time. Combined with the points above, this quickly becomes a chore to do.\"\n        }), \"\\n\", _jsx(_components.p, {\n          children: _jsx(_components.img, {\n            src: \"/assets/blog/i-have-a-new-junior-developer/no-continue.jpg\",\n            alt: \"Continue error\"\n          })\n        }), \"\\n\"]\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"All in all, the feeling I get is that I don’t want to write English. If I already have to write something, I’d rather directly write code that works.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I can see prompt engineering being a key skill to have in the future. Similar to how knowing how to search is a key skill in today’s world.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"The output is not too bad\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"For all the work it took, ChatGPT did output some pretty impressive code. Here’s some comparison between the original and the result:\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.img, {\n        src: \"/assets/blog/i-have-a-new-junior-developer/compare-1.jpg\",\n        alt: \"Comparison 1\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.img, {\n        src: \"/assets/blog/i-have-a-new-junior-developer/compare-2.jpg\",\n        alt: \"Comparison 2\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"As you can see, it did the job decently well.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"The Good\"\n      })\n    }), \"\\n\", _jsxs(_components.ul, {\n      children: [\"\\n\", _jsxs(_components.li, {\n        children: [\"\\n\", _jsxs(_components.p, {\n          children: [_jsx(_components.strong, {\n            children: \"The structure is brought over pretty well\"\n          }), _jsx(_components.br, {}), \"\\n\", \"Other than the details, the HTML structure is quite similar to the original. The spacings are off but the overall layout remains.\"]\n        }), \"\\n\"]\n      }), \"\\n\", _jsxs(_components.li, {\n        children: [\"\\n\", _jsxs(_components.p, {\n          children: [_jsx(_components.strong, {\n            children: \"The text content doesn't change\"\n          }), _jsx(_components.br, {}), \"\\n\", \"The content itself was handled well. Even though I had to double-check all of them, none of it were changed. The only exception are those derived from JS.\"]\n        }), \"\\n\"]\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"The Bad\"\n      })\n    }), \"\\n\", _jsxs(_components.ul, {\n      children: [\"\\n\", _jsxs(_components.li, {\n        children: [\"\\n\", _jsxs(_components.p, {\n          children: [_jsx(_components.strong, {\n            children: \"It had random classes\"\n          }), _jsx(_components.br, {}), \"\\n\", \"There are plenty of classes that don't do anything. Some were changed and some others were invalid tailwind classes.\"]\n        }), \"\\n\"]\n      }), \"\\n\", _jsxs(_components.li, {\n        children: [\"\\n\", _jsxs(_components.p, {\n          children: [_jsx(_components.strong, {\n            children: \"There are plenty of tiny differences\"\n          }), _jsx(_components.br, {}), \"\\n\", \"The UI looked as if a library was just upgraded and someone forgot to migrate the code. In this case, it’s because ChatGPT randomly changed the values of the classes. For example, a \", _jsx(_components.code, {\n            children: \"padding\"\n          }), \" of 3 to 4, or changing the \", _jsx(_components.code, {\n            children: \"font-weight\"\n          }), \" from bold to normal. The details were all wrong.\"]\n        }), \"\\n\"]\n      }), \"\\n\", _jsxs(_components.li, {\n        children: [\"\\n\", _jsxs(_components.p, {\n          children: [_jsx(_components.strong, {\n            children: \"It doesn’t work half the time\"\n          }), _jsx(_components.br, {}), \"\\n\", \"The screenshots above were those that I can directly compare. In reality, the results were either incomplete or just wrong enough that I had to make many changes to get it to work. And because of that, I can’t compare it side by side. There’s simply nothing I can compare with since the code doesn’t run.\"]\n        }), \"\\n\"]\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"It’s like reviewing PRs instead of writing code\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"What’s great about this is that I have something to work from. Thankfully, the work itself is very straightforward. It’s easy to spot errors. The mapping between the classes from chakra-ui and tailwind is almost one-to-one. It’s only tedious because the syntax is different.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But this approach is more akin to reviewing PRs. I had to scan through the whole code to make sure everything is done correctly.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It looks alright at first glance. But there are many gotchas once you work with it and pay attention closely. It brings this false sense of security which made me a bit frustrated once I found out about all the flaws.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"A big part of it is code that is interpolated from other codebases. It doesn’t look terrible but it’s not what I wanted.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"There are even some alarming changes like changing the heading from h2 to h1. I can only assume it did this because of the content.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: _jsx(\"u\", {\n          children: \"It felt like a junior developer slapped something together and didn’t test their code\"\n        })\n      }), \". And now I have to review and fix it without being able to tell them to fix it themselves. And this is awful. I already have my fix of reviewing PRs at work. Now I have to do it too for my own projects? No thanks!\"]\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Hopeful future\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"While I don’t think it’s anywhere near there yet, I do think AI will be helpful at some point for development in the future. Whether the answer is LLMs, who knows.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Token limits are constantly increasing\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I’ve held off finishing this article long enough. During that time, there are plenty of announcements of token limit being increased. While I’m not sure if it’s public, paid or whatever, this is great to see.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Prompting UX should get easier with time\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"With ChatGPT plugins and better integration, issues like remembering state & consistency should be improved. Hopefully, that’ll lower the effort needed to get useful output from ChatGPT.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"In the meantime, I completed the other half of the migration manually. Was it faster? Well, who knows. It felt about the same. But writing it manually did feel a whole lot better.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = {\n    ..._provideComponents(),\n    ...props.components\n  };\n  return MDXLayout ? _jsx(MDXLayout, {\n    ...props,\n    children: _jsx(_createMdxContent, {\n      ...props\n    })\n  }) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}}},"__N_SSG":true}