{"pageProps":{"title":"I have 218 browser tabs open","description":"It's been decades since the invention of browser tabs. Now, everybody uses them. What does the future of tabs look like?","image":"/assets/blog/i-have-218-browser-tabs-open/i-have-218-browser-tabs-open.png","createdAt":"Mon Aug 01 2022 01:00:00 GMT+0100 (British Summer Time)","source":{"compiledSource":"var m=Object.defineProperty,u=Object.defineProperties;var c=Object.getOwnPropertyDescriptors;var r=Object.getOwnPropertySymbols;var s=Object.prototype.hasOwnProperty,i=Object.prototype.propertyIsEnumerable;var l=(e,o,a)=>o in e?m(e,o,{enumerable:!0,configurable:!0,writable:!0,value:a}):e[o]=a,t=(e,o)=>{for(var a in o||(o={}))s.call(o,a)&&l(e,a,o[a]);if(r)for(var a of r(o))i.call(o,a)&&l(e,a,o[a]);return e},h=(e,o)=>u(e,c(o));var p=(e,o)=>{var a={};for(var n in e)s.call(e,n)&&o.indexOf(n)<0&&(a[n]=e[n]);if(e!=null&&r)for(var n of r(e))o.indexOf(n)<0&&i.call(e,n)&&(a[n]=e[n]);return a};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(a){var n=a,{components:e}=n,o=p(n,[\"components\"]);return mdx(MDXLayout,h(t(t({},layoutProps),o),{components:e,mdxType:\"MDXLayout\"}),mdx(\"p\",null,\"Yes, that number is correct. And it\\u2019s awesome! This wouldn\\u2019t be possible just a short few years ago.\"),mdx(\"p\",null,\"Everybody that heard that inevitably ask me, \",mdx(\"strong\",{parentName:\"p\"},\"\\u201CBut why do you have that many tabs open?\\u201D.\"),\" Well, let's start from the beginning.\"),mdx(\"h2\",null,mdx(\"strong\",{parentName:\"h2\"},\"A little background\")),mdx(\"p\",null,\"I've been on the internet for as long as I can remember. Maybe around 16 years? That\\u2019s probably less compared to many of you. But for me, that's more than 2/3 of my life.\"),mdx(\"p\",null,\"In that period, I went from using IE, then Chrome, to Firefox, back to Chrome and now I\\u2019ve settled with Firefox. The reason why is tightly related to why I have so many tabs open at any given time.\"),mdx(\"p\",null,mdx(\"img\",t({parentName:\"p\"},{src:\"/assets/blog/i-have-218-browser-tabs-open/browser_progression.jpg\",alt:\"My browser progression\"}))),mdx(\"p\",{style:{textAlign:\"center\",fontStyle:\"italic\",marginTop:-10,color:\"#9f9f9f\"}},\"My browser progression (excluding minor temporary ones).\"),mdx(\"h2\",null,mdx(\"strong\",{parentName:\"h2\"},\"Browser tabs changed the game\")),mdx(\"p\",null,\"By the time I browse regularly, tabs were already commonplace. I hated the times I had to use Internet explorer and open multiple windows. It was always messy and hard to navigate around.\"),mdx(\"p\",null,\"It's funny because you can argue it's not a big difference. You only move the location you click to change pages. Instead of clicking on the bottom of the screen, you click on the top instead. Meanwhile, windows allow you to place your pages wherever you want. So why are tabs so popular then?\"),mdx(\"p\",null,\"I believe the smallest of changes can make such a big difference in workflow and user experience. It\\u2019s similar to why I use \",mdx(\"a\",t({parentName:\"p\"},{href:\"https://i3wm.org/\"}),\"i3\"),\", a tiling window manager. More constraint and scoping can be very helpful. I might write a separate article about it in the future.\"),mdx(\"p\",null,\"No matter the reason, I think most will agree that \",mdx(\"strong\",{parentName:\"p\"},\"tabs made people open more pages compared to window navigation.\")),mdx(\"p\",null,mdx(\"img\",t({parentName:\"p\"},{src:\"/assets/blog/i-have-218-browser-tabs-open/tab_example.png\",alt:\"Example of browser tabs\"}))),mdx(\"p\",{style:{textAlign:\"center\",fontStyle:\"italic\",marginTop:-10,color:\"#9f9f9f\"}},\"Example of browser tabs\"),mdx(\"h2\",null,mdx(\"strong\",{parentName:\"h2\"},\"Opening many tabs would lag my PC\")),mdx(\"p\",null,\"By this point, I was regularly opening tens of tabs. Specific activities also increase that number by a lot - like researching a topic.\"),mdx(\"p\",null,\"You know where this is going. My PC would lag. It would freeze randomly. Pages also start taking longer to load. Whoops, I\\u2019ve run out of memory.\"),mdx(\"h2\",null,mdx(\"strong\",{parentName:\"h2\"},\"It\\u2019s hard to find the tabs you want\")),mdx(\"p\",null,\"Another issue is the lack of horizontal space. As you open more tabs, each tab continues to decrease in size. This is annoying to deal with. What if you\\u2019re doing some research and you open a bunch of random websites? You don\\u2019t know what their favicon looks like. Now you have to open them one by one to find the one you were looking for. \"),mdx(\"p\",null,mdx(\"img\",t({parentName:\"p\"},{src:\"/assets/blog/i-have-218-browser-tabs-open/tab_hell.png\",alt:\"Tab hell\"}))),mdx(\"p\",{style:{textAlign:\"center\",fontStyle:\"italic\",marginTop:-10,color:\"#9f9f9f\"}},\"Tab hell\"),mdx(\"h2\",null,mdx(\"strong\",{parentName:\"h2\"},\"A new way of viewing tabs\")),mdx(\"p\",null,\"One day I found the \",mdx(\"a\",t({parentName:\"p\"},{href:\"https://addons.mozilla.org/en-US/firefox/addon/tree-style-tab/\"}),\"Tree Style Tab\"),\" extension. It displays your tabs as a tree but more importantly, it\\u2019s \",mdx(\"strong\",{parentName:\"p\"},\"vertical.\"),\" Not a big deal right?\"),mdx(\"p\",null,mdx(\"img\",t({parentName:\"p\"},{src:\"/assets/blog/i-have-218-browser-tabs-open/tree_style_tabs.jpg\",alt:\"Tree Style Tabs\"}))),mdx(\"p\",{style:{textAlign:\"center\",fontStyle:\"italic\",marginTop:-10,color:\"#9f9f9f\"}},\"Tree Style Tabs in action\"),mdx(\"p\",null,\"Turns out this entirely changed the game for me. Just like the change from windows to tabs enabled more tabs to be open, tree tabs did the same. Horizontal tabs are awful to manage after 15 tabs. \",mdx(\"strong\",{parentName:\"p\"},\"With tree styles, you can easily manage more than 60 tabs with little to no issue.\")),mdx(\"p\",null,\"In tree tabs, the titles are always visible no matter how many tabs you have open. When you open a link in a new tab, it will be nested within the previous tab indicating how you reached that page\"),mdx(\"h2\",null,mdx(\"strong\",{parentName:\"h2\"},\"Navigation is king\")),mdx(\"p\",null,\"Around the same time, I also found the \",mdx(\"a\",t({parentName:\"p\"},{href:\"https://github.com/philc/vimium\"}),\"Vimium\"),\" extension. It enables vim-like navigation in your browser. \",mdx(\"strong\",{parentName:\"p\"},\"You can practically do any action you want with just your keyboard.\"),\" The best way to show you is to demo it.\"),mdx(\"div\",{style:{position:\"relative\",paddingBottom:\"56.25%\"}},mdx(\"iframe\",{style:{width:\"100%\",height:\"100%\",position:\"absolute\"},src:\"https://www.youtube.com/embed/r7G2B8JgFFg?controls=0\",title:\"YouTube video player\",frameborder:\"0\",allow:\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\",allowfullscreen:!0})),mdx(\"p\",null,\"All of those actions were done with a keyboard. At the 20s mark, I used a shortcut to go back to the previous tab (basically alt-tab). And at 15s & 22s, you can see the ability to search for a tab. Combined with Tree style tabs, managing many tabs becomes a breeze.\"),mdx(\"h2\",null,mdx(\"em\",{parentName:\"h2\"},\"\\u201CBut wouldn\\u2019t your PC lag all the time?\\u201D\")),mdx(\"p\",null,\"Thankfully \",mdx(\"strong\",{parentName:\"p\"},mdx(\"a\",t({parentName:\"strong\"},{href:\"https://en.wikipedia.org/wiki/Moore%27s_law\"}),\"Moore's law\")),\" is in full effect. While each web page keeps increasing in size, hardware increased its performance even more! CPU keeps increasing their core count and RAM gets cheaper each year (well, let\\u2019s ignore the chip shortage :wink:). At the moment, I have 48GB of RAM to handle all my needs.\"),mdx(\"h2\",null,mdx(\"strong\",{parentName:\"h2\"},\"Even more tabs!\")),mdx(\"p\",null,\"You might\\u2019ve noticed a theme here. I found another extension! It\\u2019s called \",mdx(\"a\",t({parentName:\"p\"},{href:\"https://github.com/mbnuqw/sidebery\"}),\"Sideberry\"),\". \"),mdx(\"p\",null,\"Sideberry looks very similar to Tree style tabs. However, it introduced a concept called panels. \",mdx(\"strong\",{parentName:\"p\"},\"Each panel has its own list of tabs\"),\". It allows you to compartmentalize your tabs into separate buckets.\"),mdx(\"p\",null,mdx(\"img\",t({parentName:\"p\"},{src:\"/assets/blog/i-have-218-browser-tabs-open/sideberry_panels.jpg\",alt:\"Panels in Sideberry\"}))),mdx(\"p\",{style:{textAlign:\"center\",fontStyle:\"italic\",marginTop:-10,color:\"#9f9f9f\"}},\"Panels in Sideberry\"),mdx(\"p\",null,\"On a typical day, I usually work on several projects. I would use a panel for each long-running project. One for entertainment and another for rabbit holes I happen to stumble upon. Each panel have about 50 tabs on average.\"),mdx(\"p\",null,\"So you can imagine how I get to 200+ tabs very easily. I believe I even reached 300 tabs once or twice before. Once I\\u2019m used to having about 70 tabs, I started to have more open from 100, 150, 200, and eventually 300. It doesn\\u2019t make that much of a difference.\"),mdx(\"p\",null,\"It does depend on what I\\u2019m doing. It\\u2019s currently a less busy time. And at this time of writing, I \\u201Conly\\u201D have 151 tabs open. Not too bad!\"),mdx(\"h2\",null,mdx(\"strong\",{parentName:\"h2\"},\"Just because it\\u2019s there doesn\\u2019t mean it\\u2019s open\")),mdx(\"p\",null,\"If you\\u2019re still not convinced that this works, there\\u2019s more! Sideberry also allows you to unload a page. An unloaded page doesn\\u2019t consume resources. When you open it, it will load the page from scratch. This means that you can have as many tabs open without having performance issues! Just make sure you unload some of them.\"),mdx(\"p\",null,mdx(\"img\",t({parentName:\"p\"},{src:\"/assets/blog/i-have-218-browser-tabs-open/sideberry_panels_2.jpg\",alt:\"Sideberry unloaded tabs\"}))),mdx(\"p\",{style:{textAlign:\"center\",fontStyle:\"italic\",marginTop:-10,color:\"#9f9f9f\"}},\"Sideberry unloaded tabs\"),mdx(\"h2\",null,mdx(\"strong\",{parentName:\"h2\"},mdx(\"em\",{parentName:\"strong\"},\"\\u201CSure, the technology allows you to do it. But just because you can doesn\\u2019t mean you should!\\u201D\"))),mdx(\"p\",null,\"To that I say: Why shouldn\\u2019t I? Having these tabs gives me 2 huge benefits:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"I can see how I got to the pages I did when researching. From there I can easily close the tree when it doesn\\u2019t lead to good content.\"),mdx(\"li\",{parentName:\"ul\"},\"The tabs act as a reminder of things I want or need to work on.\")),mdx(\"p\",null,\"Imagine browsing \",mdx(\"a\",t({parentName:\"p\"},{href:\"https://news.ycombinator.com/\"}),\"Hacker News\"),\" and you stumble upon a gold mine. It had so many good resources that you can\\u2019t help but open all the links. Half of them turn out to be useless and you close them. Now you\\u2019re left with 4 things you want to know more about. So you decide to leave them open. Then you go through each of them, opening links and reading them.\"),mdx(\"p\",null,\"When you\\u2019re done, you can easily close the whole tree since they\\u2019re sorted as such. Now the other 2 pages are products you want to try. But you don\\u2019t have time for that right now. So you leave them open and continue with work on a separate Sideberry panel. When you\\u2019re free, you go back to the other panel and try the product. Turns out it was awesome and everyone lived happily ever after.\"),mdx(\"h2\",null,mdx(\"em\",{parentName:\"h2\"},\"\\u201CWhy not use bookmarks?\\u201D\")),mdx(\"p\",null,\"I have 280 bookmarks. A good dozen for quick access links. Most are resources and cool things I might want to check again in the future. Maybe it\\u2019s an early access product and I want to check back once it\\u2019s more stable.\"),mdx(\"p\",null,\"It\\u2019s simply \",mdx(\"strong\",{parentName:\"p\"},\"a different use case\"),\". I use bookmarks for long-term things. They\\u2019re curated and I rarely open them until I need something to refer to. For example, I have a folder containing websites that provide quality SVG arts.\"),mdx(\"p\",null,\"When I leave something as a tab, they are either:\"),mdx(\"ol\",null,mdx(\"li\",{parentName:\"ol\"},\"Things I use often - So I don\\u2019t see the point in closing them\"),mdx(\"li\",{parentName:\"ol\"},\"Things I want to continue researching\")),mdx(\"h2\",null,\"It\\u2019s part of a workflow\"),mdx(\"p\",null,\"Tabs that are left open go into a workflow that helps me sort out relevant pages. Naturally, I would consume the most relevant pages from the list. Those tabs are then closed in due time.\"),mdx(\"p\",null,\"Less relevant pages will be left in the list. Eventually, they automatically turn into an unloaded tab. And if they keep being not relevant, I will then close them.\"),mdx(\"p\",null,\"So perhaps I was extremely excited about the wonders of \",mdx(\"a\",t({parentName:\"p\"},{href:\"https://www.deepsouthventures.com/i-sell-onions-on-the-internet/\"}),\"Vidalia onions\"),\" when I first saw them. But over time, the workflow proved that I don\\u2019t actually care about it all that much.\"),mdx(\"p\",null,mdx(\"img\",t({parentName:\"p\"},{src:\"/assets/blog/i-have-218-browser-tabs-open/tab_workflow.jpg\",alt:\"My tab workflow\"}))),mdx(\"p\",{style:{textAlign:\"center\",fontStyle:\"italic\",marginTop:-10,color:\"#9f9f9f\"}},\"My tab workflow\"),mdx(\"h2\",null,\"Try it out\"),mdx(\"p\",null,\"And that\\u2019s it! Now I can share this post with anyone that questions my workflow. While I\\u2019m not necessarily saying you should have that many tabs open, I would recommend you to try Sideberry if you\\u2019re on Firefox. On Chrome, your options would be to try Tree Style Tabs. Who knows it might change your life too.\"),mdx(\"p\",null,\"If you\\u2019re interested in this kind of content, \",mdx(\"a\",t({parentName:\"p\"},{href:\"https://www.notion.so/Tech-929821000e564805bc0972cbc74604d8\"}),\"follow me on Twitter\"),\" where you\\u2019ll find similar things!\"))}MDXContent.isMDXComponent=!0;\n","scope":{}}},"__N_SSG":true}